tags/1_0_1/test/test-ws-handlers/docs/handler-test-results/c-ok-s-ok-app-se.txt


Handler C... error behaviour:

|--------- |--------------|------------------------|---------------------------|
|          | return false | throw RuntimeException | throw SOAPFaultException  |
|----------|--------------|------------------------|---------------------------|
|Client OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server IN |              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Client IN |              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|

Server application throws a declared fault (ServiceError) caused by a null pointer exception

Trace:
--------------------------------------------------------------------------------
Client-side
                    Server-side
--------------------------------------------------------------------------------

                    INFO: WSSERVLET12: JAX-WS context listener initializing
                    handler.server.HandlerAdams@3d511e> (constructor)
                    handler.server.HandlerBoston@198a35d> (constructor)
                    handler.server.HandlerChicago@d41f3> (constructor)
                    handler.server.HandlerDenver@64dd79> (constructor)
                    handler.server.HandlerEasy@86359> (constructor)
                    2/Mai/2008 18:28:14 com.sun.xml.ws.transport.http.servlet.WSServletDelegate init

                    INFO: WSSERVLET14: JAX-WS servlet initializing


Running the hello.HelloServiceClient program...
handler.client.HandlerAlpha@12f9ee> (constructor)
handler.client.HandlerBravo@106fc94> (constructor)
handler.client.HandlerCharlie@7f5580> (constructor)
handler.client.HandlerDelta@84cc09> (constructor)
handler.client.HandlerEcho@676437> (constructor)
handler.client.HandlerAlpha@12f9ee> getHeaders()
handler.client.HandlerBravo@106fc94> getHeaders()
handler.client.HandlerCharlie@7f5580> getHeaders()
handler.client.HandlerDelta@84cc09> getHeaders()
handler.client.HandlerEcho@676437> getHeaders()
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>
handler.client.HandlerAlpha@12f9ee> handleMessage() - Outbound SOAP message
handler.client.HandlerBravo@106fc94> handleMessage() - Outbound SOAP message
handler.client.HandlerCharlie@7f5580> handleMessage() - Outbound SOAP message
handler.client.HandlerDelta@84cc09> handleMessage() - Outbound SOAP message
handler.client.HandlerEcho@676437> handleMessage() - Outbound SOAP message
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>


                    handler.server.HandlerAdams@3d511e> getHeaders()
                    handler.server.HandlerBoston@198a35d> getHeaders()
                    handler.server.HandlerChicago@d41f3> getHeaders()
                    handler.server.HandlerDenver@64dd79> getHeaders()
                    handler.server.HandlerEasy@86359> getHeaders()
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@86359> handleMessage() - Inbound SOAP message
                    handler.server.HandlerDenver@64dd79> handleMessage() - Inbound SOAP message
                    handler.server.HandlerChicago@d41f3> handleMessage() - Inbound SOAP message
                    handler.server.HandlerBoston@198a35d> handleMessage() - Inbound SOAP message
                    handler.server.HandlerAdams@3d511e> handleMessage() - Inbound SOAP message
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    Caught exception:
                    class java.lang.NullPointerException
                    Throwing a test null pointer exception in service implementation class
                    Outbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><soapenv:Fault xmlns:soapenv="http://schemas.xmlsoap.org/s
                    oap/envelope/"><faultcode>soapenv:Server</faultcode><faultstring>Service unavail
                    able, please try again later.</faultstring><detail><ns1:serviceError xmlns:xsi="
                    http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"></ns1:serviceError></d
                    etail></soapenv:Fault></soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerAdams@3d511e> handleFault() - Outbound SOAP message
                    handler.server.HandlerBoston@198a35d> handleFault() - Outbound SOAP message
                    handler.server.HandlerChicago@d41f3> handleFault() - Outbound SOAP message
                    handler.server.HandlerDenver@64dd79> handleFault() - Outbound SOAP message
                    handler.server.HandlerEasy@86359> handleFault() - Outbound SOAP message
                    Outbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><soapenv:Fault xmlns:soapenv="http://schemas.xmlsoap.org/s
                    oap/envelope/"><faultcode>soapenv:Server</faultcode><faultstring>Service unavail
                    able, please try again later.</faultstring><detail><ns1:serviceError xmlns:xsi="
                    http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"></ns1:serviceError></d
                    etail></soapenv:Fault></soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@86359> close()
                    handler.server.HandlerDenver@64dd79> close()
                    handler.server.HandlerChicago@d41f3> close()
                    handler.server.HandlerBoston@198a35d> close()
                    handler.server.HandlerAdams@3d511e> close()


Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><soapenv:Fault xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><faultcode>soapenv:Server</faultcode><faultstring>Service unavailable, please try again later.</faultstring><detail><ns1:serviceError xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"></ns1:serviceError></detail></soapenv:Fault></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@676437> handleMessage() - Inbound SOAP message
handler.client.HandlerDelta@84cc09> handleMessage() - Inbound SOAP message
handler.client.HandlerCharlie@7f5580> handleMessage() - Inbound SOAP message
handler.client.HandlerBravo@106fc94> handleMessage() - Inbound SOAP message
handler.client.HandlerAlpha@12f9ee> handleMessage() - Inbound SOAP message
Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><soapenv:Fault xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><faultcode>soapenv:Server</faultcode><faultstring>Service unavailable, please try again later.</faultstring><detail><ns1:serviceError xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"></ns1:serviceError></detail></soapenv:Fault></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@676437> close()
handler.client.HandlerDelta@84cc09> close()
handler.client.HandlerCharlie@7f5580> close()
handler.client.HandlerBravo@106fc94> close()
handler.client.HandlerAlpha@12f9ee> close()
Exception in thread "main" hello.ws.stubs.ServiceError: Service unavailable, please try again later.
	at sun.reflect.NativeConstructorAccessorImpl.newInstance0(Native Method)
	at sun.reflect.NativeConstructorAccessorImpl.newInstance(NativeConstructorAccessorImpl.java:39)
	at sun.reflect.DelegatingConstructorAccessorImpl.newInstance(DelegatingConstructorAccessorImpl.java:27)
	at java.lang.reflect.Constructor.newInstance(Constructor.java:494)
	at com.sun.xml.ws.encoding.soap.ClientEncoderDecoder.createCheckedException(ClientEncoderDecoder.java:269)
	at com.sun.xml.ws.encoding.soap.ClientEncoderDecoder.toMessageInfo(ClientEncoderDecoder.java:87)
	at com.sun.xml.ws.encoding.soap.client.SOAPXMLDecoder.toMessageInfo(SOAPXMLDecoder.java:200)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.receive(SOAPMessageDispatcher.java:549)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.doSend(SOAPMessageDispatcher.java:288)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.send(SOAPMessageDispatcher.java:153)
	at com.sun.xml.ws.encoding.soap.internal.DelegateBase.send(DelegateBase.java:85)
	at com.sun.xml.ws.client.EndpointIFInvocationHandler.implementSEIMethod(EndpointIFInvocationHandler.java:176)
	at com.sun.xml.ws.client.EndpointIFInvocationHandler.invoke(EndpointIFInvocationHandler.java:105)
	at $Proxy19.sayHello(Unknown Source)
	at hello.HelloServiceClient.main(HelloServiceClient.java:10)
